{
    "posts": [
      {

        "id": "81",
        "platform": "Facebook",
        "content": "I tried taking my life 3 times. My friends told me they always thought I was doing better because I seemed so happy. I was happy because it was ending. Obviously I’m still here and I’m glad I am, but as someone who has been so bad they had to be hospitalized, please keep an eye on your friends, and if they don’t make it please don’t take it personally. You are probably the reason they made it so long in the first place.",
        "label": "suicidal ideation"
      },
      {

        "id": "82",
        "platform": "Facebook",
        "content": "'But if only they had talked to me I could have helped...' that's the biggest line of BS from those that don't live with this. No you wouldn't. They have asked, but you were too busy, or just don't want to deal with their issues'. They know you see them as a burden, but reached out anyways. GTFOH with your 'it's selfish nonsense'",
        "label": "suicidal ideation"
      }, {

        "id": "83",
        "platform": "Facebook",
        "content": "I can't imagine feeling confident enough to tell someone it's okay to unalive yourself. Life's hard enough, I can't imagine having the strength or courage to leave my kids behind in this world. Every down shaped me into the person I am. Everything that ever showed me pain, also showed me the reason why I'll never get to those points in my life again. We could be homeless, in jail, and the whole world can be against us. That come back will provide the strength you need to continue. It can't get any worse than it already is unless you actually fucked yourself then you gotta eat your lesson, and come back mentally stronger. Life is special every single day. Being able to see anyone we love be happy is way more important than money. Being the change is way more better than becoming a percentage of a statistic. Keep fighting. Mental health is real.",
        "label": "suicidal ideation"
      }, {

        "id": "84",
        "platform": "Facebook",
        "content": "I struggled with depression, SH, suicidal thoughts, etc for years.I have been living in freedom now for for close to 5 years. There is hope. There is another side to what you are feeling. Finding people to open up to and be transparent with was a game changer. Jesus can and will move mountains. It’s doesn’t always look like how or when you expect it to but looking back I would not change my experience for anything. I am who I am today because of it.",
        "label": "suicidal ideation"
      }, {
        "id": "85",
        "platform": "Facebook",
        "content": "I never thought my life would lead me to a place where I could genuinely say I am living without an anxiety disorder. I am living without depression. I am living without Complex-PTSD and I get to HELP OTHER PEOPLE DO THAT! Like, holy shit! I get to make a life and living out of helping other people with their own healing journeys and that has been more meaningful than anything I could have ever hoped. ",
        "label": "suicidal ideation"
      }, {
        "id": "86",
        "platform": "Facebook",
        "content": "Two years ago today, i decided i had had enough. The best way i can put it is 'my brain was trying to kill me'. Suicidal ideation is a real struggle. The thoughts and feelings that lead to it are real. YEARS of fighting against my inner demons had worn me down, to the point that i was ready to give up and give in. I had it all planned out. The when. The how. But instead i walked into my counselor's office for… See more",
        "label": "suicidal ideation"
      },
      {
        "id": "87",
        "platform": "Facebook",
        "content": " And I never really had that. I just feel like sometimes I'm existing for the sake of existing out of procreation. I'm at a point in my life 7 years later, where I am steadily working towards improving myself and surviving. I just wonder to myself: when does this ever end?",
        "label": "suicidal ideation"
      },
      {
        "id": "88",
        "platform": "Facebook",
        "content": " WANNA DIE!!!💔💔😭😭😭😭😭 NO ONE CARES! I GOT NO FRIENDS! 💔💔💔😭😭😭 NO ONE HITS ME UP",
        "label": "suicidal ideation"
      },
      {
        "id": "89",
        "platform": "Facebook",
        "content": "my demons are winning",
        "label": "suicidal ideation"
      },
      {
        "id": "90",
        "platform": "Facebook",
        "content": "",
        "label": "suicidal ideation"
      }, 
      {
        "id": "21",
        "platform": "Twitter",
        "content": "Goes great with Benadryl & sleeping pills which has been my breakfast & dinner for the last several weeks. #suicidal",
        "label": "suicidal ideation"
      },
      {
        "id": "22",
        "platform": "Twitter",
        "content": "applying to jobs while at work, might become #suicidal if i don't quit soon",
        "label": "suicidal ideation"
      }, {
        "id": "23",
        "platform": "Twitter",
        "content": "Mine did. And shit broken down 💩🤡 that bitch saw everything in my body!! Couldn’t take it anymore. #Suicidal",
        "label": "suicidal ideation"
      }, {
        "id": "24",
        "platform": "Twitter",
        "content": "feeling #suicidal",
        "label": "suicidal ideation"
      }, {
        "id": "25",
        "platform": "Twitter",
        "content": "out in public with no makeup on feeling #suicidal",
        "label": "suicidal ideation"
      }, {
        "id": "26",
        "platform": "Twitter",
        "content": "Imagine being so brainwashed that you would make a video about lies and present them as facts. #TDS #SICKNESS #MENTAL_ILLNESS #BRAIN_DEAD  #SUICIDAL #INSTITUTIONALIZED #HUNGARY_TURD",
        "label": "suicidal ideation"
      },
      {
        "id": "27",
        "platform": "Twitter",
        "content": "entering  my  villain  era  after  these  ten  laps  y’all  hoes  better  let  me  in  .feeling:  #suicidal 💔😔‼️‼️",
        "label": "suicidal ideation"
      },
      {
        "id": "28",
        "platform": "Twitter",
        "content": "mood: #missmybitch #weup #Suicidal",
        "label": "suicidal ideation"
      },
      {
        "id": "29",
        "platform": "Twitter",
        "content": "thinking alot of thinks #suicidal",
        "label": "suicidal ideation"
      },
      {
        "id": "30",
        "platform": "Twitter",
        "content": "goodnight feeling #suicidal i hope i don’t wake up ever again🔥",
        "label": "suicidal ideation"
      }, 
      {
        "id": "51",
        "platform": "Reddit",
        "content": "That's exactly how I've been feeling. Death would be so nice and peaceful. No having to deal with anxiety, sadness, anger, no more worries about jobs or money or family. Most times I wish I could die simply because it's peaceful and I wouldn't have to deal with this shit anymore. Like if I died, I would accept it and probably be happy about it. But at the same time, I have no desire to kill myself or harm myself. I'm not actively seeking death, but I would welcome it if it came to me. If that makes sense",
        "label": "suicidal ideation"
      },
      {
        "id": "52",
        "platform": "Reddit",
        "content": "This, so much this. I've been passively suicidal for decades, neglecting my health and hoping something major would fail and finally kill me.",
        "label": "suicidal ideation"
      }, {
        "id": "53",
        "platform": "Reddit",
        "content": "I am in my fourties and am stuck with these thoughts constantly since I was about 10 years old. This is a daily grind and only getting inebriated and sleep is escape.",
        "label": "suicidal ideation"
      }, {
        "id": "54",
        "platform": "Reddit",
        "content": "Yes. I feel that the only purpose of staying alive is the duty I owe to other people, either to care for them or just not hurt them. I would welcome no longer existing. My health has started going to hell and I’m not even 40. I don’t even care, I have no issue with the thought of my life being shorter.",
        "label": "suicidal ideation"
      }, {
        "id": "55",
        "platform": "Reddit",
        "content": "This is how I've felt for a long time. I'm not going to do anything, but I'm tired of being alive. I hate the thought of living another 50-70 years pretending to be happy or keep my head above the water.I was in a plane the other day and we had major turbulence. At one point I thought the plane might go down and it was honestly a massive sense of relief.",
        "label": "suicidal ideation"
      }, {
        "id": "56",
        "platform": "Reddit",
        "content": "I haven't attempted in awhile but I do weekdays wish that my heart would just stop.",
        "label": "suicidal ideation"
      },
      {
        "id": "57",
        "platform": "Reddit",
        "content": "This is a real thing. I struggle with smoking (pot). I'm the youngest of 7 siblings. I've already lost one (f*cking glioblastoma). I've realized I really don't want to outlive the others. :( At the same time I want to see my son grow into a man, so I have so far managed to kick smoking, taken up 3 season cycling, and am trying to figure out what to do with myself in the gym.",
        "label": "suicidal ideation"
      },
      {
        "id": "58",
        "platform": "Reddit",
        "content": "Very familiar with the feeling. Forcing death on the body seemed extreme, and would leave dark holes on other people lives, without knowing if taking own life would end the suffering, because it seemed way too easy, so just settled for praying to die as the only lifelong prayer. I have been fortunate where spiritual teachings resonated with me, and I have been able to turn my desire to die into a positive thing, since ego death is the road to happiness in spiritual context.",
        "label": "suicidal ideation"
      },
      {
        "id": "59",
        "platform": "Reddit",
        "content": "this is going to sound weird but low key wishing I was dead (and not minding if I do), makes people think of me as a fun, life-loving person which is hilarious (to me). I am always down to go anywhere and do anything as long as I can numb the dread for a few hours with alcohol, drugs and socializing. I come off as super confident and extroverted because I do not care AT ALL what happens to me or what people think of me. At the same time, everytime I cross the street I wonder what would happen if I didn’t look at the traffic sign, and sometimes I really don’t.",
        "label": "suicidal ideation"
      },
      {
        "id": "60",
        "platform": "Reddit",
        "content": "It’s like if someone was pointing a gun at me I wouldn’t actually feel threatened I would just wish they take a headshot. So getting mugged or something I would make it difficult and lowkey hope they pull the trigger. Technically it’s not suicide. It is what it is. Fuck life.",
        "label": "suicidal ideation"
      }
    ]
  }
  