{
    "posts": [
      {
        "id": "11",
        "platform": "Twitter",
        "content": "Weight gain due to depression is real ! Have put on 20+ kgs without any significant diet or activity changes !Not sure how to get back in shape !#Depression #weightgain #fitness",
        "label": "depression"
      },
      {
        "id": "12",
        "platform": "Twitter",
        "content": "Morning all. The sun is shining, but I still can’t shake this empty feeling. #depression There is so much worrying news in the world right now, and I’m fearful of the future. Scary stuff going on😢",
        "label": "depression"
      },
      {
        "id": "13",
        "platform": "Twitter",
        "content": "I'd rather my heart stop than continue to break.#alone #nobodylistens #depression #life #death  #EVERYTHING",
        "label": "depression"
      },
      {
        "id": "14",
        "platform": "Twitter",
        "content": "Good bloody thing I'm on my new meds this week from the #VAHospital. There are so many idiot people that think they are so entitled. Well surprise heros, you're not! Now going to cuddle with one our #GreatDanes and try and #Sleep. #Tinnitus #Depression #Anxiety #DogsAreTheBest",
        "label": "depression"
      },
      {
        "id": "15",
        "platform": "Twitter",
        "content": "#depression is real and I'm doing my best to beat this thing. #mentalhealth is serious and I'm on a mission to overcome this.",
        "label": "depression"
      },
      {
        "id": "16",
        "platform": "Twitter",
        "content": "I’ve hit a very important milestone in my life. I am now fat enough, and depressed enough, to get all of my clothes from Costco.",
        "label": "depression"
      },
      {
        "id": "17",
        "platform": "Twitter",
        "content": "Bc I’m listening to tame impala rn and I would do anything to be a millennial in their senior year of college going to Coachella in 2019 with their friends high on shrooms while I was forced to be a 4th grader that lived in Texas who was only 10 years old at the time #depression",
        "label": "depression"
      },
      {
        "id": "19",
        "platform": "Twitter",
        "content": "Depression is a bitch. So, more Final Fantasy XII! Come hang out!  #FinalFantasy #depression",
        "label": "depression"
      },
      {
        "id": "20",
        "platform": "Twitter",
        "content": "Couldn't stop crying till I was unable to breathe.Everyday is difficult to survive. Why am I posting all this here? The reason is I don't have anyone to listen. I've no idea how to deal with pain. #MentalHealthAwareness #MentalHealthSupport #depression",
        "label": "depression"
      },
      {
        "id": "71",
        "platform": "Facebook",
        "content": "Therapy doesn’t change unlivable conditions. Poverty is traumatizing. Exploitation is traumatizing. No access to healthcare is traumatizing. Therapy helps you deal with the trauma after the fact. It’s like a cast for a broken arm. But what’s the point of casting it if your bones are being rebroken daily?",
        "label": "depression"
      },

      {
        "id": "72",
        "platform": "Facebook",
        "content": "Great. Now I’ve got more guilt pushing harder into my executive dysfunction trap and keeping me on the couch.Hopefully this helps someone else.",
        "label": "depression"
      },

      {
        "id": "73",
        "platform": "Facebook",
        "content": "Now I'm depressed & can't get off the couch",
        "label": "depression"
      },

      {
        "id": "74",
        "platform": "Facebook",
        "content": "All of this, but I can't crash when I get home. I have to be there for my kids. It's also why I have my animals the keep me here, present, and busy too. I'm not living in my own home so my animals can't be inside with me anymore and it's so hard to adjust to it. It's like I lost all of my security blankets all at once. Nothing beats snuggling in bed with my kids and animals.",
        "label": "depression"
      },

      {
        "id": "75",
        "platform": "Facebook",
        "content": "Yes…I’ll feel like I have motivation when I wake up and the littlest thing will pull me off of it and then feel down. Hote it",
        "label": "depression"
      },

      {
        "id": "76",
        "platform": "Facebook",
        "content": "I decided to stop this but I did it for 3 years after my Dad died and I moved back home to be closer to family. I was 3 years sober, the pandemic happened, rejected by family. I got tired of this. I have my Days but they are more seldom. I think I had to do this. I’m glad it is over.",
        "label": "depression"
      },

      {
        "id": "77",
        "platform": "Facebook",
        "content": "Literally going through it now. Begging for help and no one seems to care. It's rough. But I have 2 kids that need me. They are the only reason I'm still here. Makes me even more sad to say that b",
        "label": "depression"
      },

      {
        "id": "79",
        "platform": "Facebook",
        "content": "Some of us are pretty much just alone without many people to care about us. If I died tomorrow people would care about me way more then they ever did in life and that’s sad dude and sometimes selfishly makes me idealize the idea of it when I’m in my most depressed state.",
        "label": "depression"
      },

      {
        "id": "80",
        "platform": "Facebook",
        "content": "Therapy is great when you're receptive and not depressed, all the tools they teach you are to hemp in the situations that don't stop, breathing, counting, colors, mindfulness..... it all it's great when you're not in the state, a lot of us have been in therapy for years but doesn't change how I can be happy before I got to sleep and wake up emotionally depressed for weeks along with anxiety and all else that comes woth it..... sometimes finding a person or thing to live for is what helps.... in my case my father is what keeps me going when he leaves this earth hopefully I'll find something else",
        "label": "depression"
      },{
        "id": "41",
        "platform": "Reddit",
        "content": "Sleeping to avoid living. Even if you’re not necessarily tired.",
        "label": "depression"
      },
      {
        "id": "42",
        "platform": "Reddit",
        "content": "Constantly in a world in your head. I struggle with living like this. My mind and body are normally never in the same place.",
        "label": "depression"
      },
      {
        "id": "43",
        "platform": "Reddit",
        "content": "Feeling like it’s a chore to do things that you used to love doing.        ",
        "label": "depression"
      },
      {
        "id": "44",
        "platform": "Reddit",
        "content": "Snoozing for an eternity because you know what awaits you when you get up and face the day.",
        "label": "depression"
      },
      {
        "id": "45",
        "platform": "Reddit",
        "content": "Just kinda waiting for the day to end each day",
        "label": "depression"
      },
      {
        "id": "46",
        "platform": "Reddit",
        "content": "Depression doesn’t scream, it would require too much energy.",
        "label": "depression"
      },
      {
        "id": "47",
        "platform": "Reddit",
        "content": "I actually don't remember not being depressed. I believe I've had it since childhood.",
        "label": "depression"
      },
      {
        "id": "49",
        "platform": "Reddit",
        "content": "I met a girl, we instantly hit it off. Everything was perfect and she was my dream girl, even in my wildest imagination I couldn’t think of someone more perfect. Suddenly her ex bf came back into her life, threatened her with suicide if she ignores him, told her his whole family will blame her for his death. I knew the guy and i knew he is a loser and might actually do it. Anyways, i let her get back to him and wanted her to decide if she wants to comeback to me or stay with him. In the end, the guy who created the drama won and she married him 2 years later. I was in severe depression all that time and had 0 interest in anything, it was so hard to bounce back.",
        "label": "depression"
      },
      {
        "id": "50",
        "platform": "Reddit",
        "content": "I was molested as a child, I was bullied in school and grew up in a toxic household. A lot of my early memories are just my parents arguing and my mum getting physically violent with my dad. They both used to bully me for my weight as a kid/teen (I was a little bit chubby but still within the healthy range) and I ended up developing anorexia at 15. I’m getting therapy now and I feel like I can finally see some light at the end of the tunnel, but I don’t think I’ll ever be ‘better’ :/",
        "label": "depression"
      }
    ]
  }
  