{
    "posts": [
      {
        "id": "62",
        "platform": "Facebook",
        "content": "I stretched one night and felt excruciating pain in my left rib. I could barely move. I managed to get to a hospital and was told it was costochondritis — inflammation of the cartilage connecting the ribs to the sternum — and anxiety. They gave me an anti-inflammatory medication and told me I’d be good. ",
        "label": "anxiety"
      },

      {
        "id": "63",
        "platform": "Facebook",
        "content": "I decided to stop this but I did it for 3 years after my Dad died and I moved back home to be closer to family. I was 3 years sober, the pandemic happened, rejected by family. I got tired of this. I have my Days but they are more seldom. I think I had to do this. I’m glad it is over.",
        "label": "anxiety"
      },

      {
        "id": "64",
        "platform": "Facebook",
        "content": "",
        "label": "anxiety"
      },

      {
        "id": "65",
        "platform": "Facebook",
        "content": "This happened to me 1st time at 10yr old and I couldn't explain other than I feel like its hard to breathe so my dad took me to ER and after they proceeded to tell him it was a panic attack, I got in trouble for 'faking being sick' can't imagine why I mightve been having panick attacks at 1",
        "label": "anxiety"
      },

      {
        "id": "66",
        "platform": "Facebook",
        "content": "This is happening a lot lately I can't complete my yawn and then the shallow breathing and panic sets in",
        "label": "anxiety"
      },

      {
        "id": "67",
        "platform": "Facebook",
        "content": "his happens ALL the time even just hanging out in my living room. Anxiety symptoms have become so consistent I've just kind of started to ignore them",
        "label": "anxiety"
      },

      {
        "id": "68",
        "platform": "Facebook",
        "content": "his happens ALL the time even just hanging out in my living room. Anxiety symptoms have become so consistent I've just kind of started to ignore them",
        "label": "anxiety"
      },

      {
        "id": "69",
        "platform": "Facebook",
        "content": "Okay, get this: anxiety, asthma, non-epileptic seizures induced by anxiety. First came anxiety, then the asthma and now I have anxiety seizures. Or so the doctor says. Idk. I'm kinda fkn done. I hate it here. ",
        "label": "anxiety"
      },

      {
        "id": "70",
        "platform": "Facebook",
        "content": "Thanks now I forgot how to breathe",
        "label": "anxiety"
      },

      {
        "id": "71",
        "platform": "Facebook",
        "content": "Therapy doesn’t change unlivable conditions. Poverty is traumatizing. Exploitation is traumatizing. No access to healthcare is traumatizing. Therapy helps you deal with the trauma after the fact. It’s like a cast for a broken arm. But what’s the point of casting it if your bones are being rebroken daily?",
        "label": "depression"
      },

      {
        "id": "72",
        "platform": "Facebook",
        "content": "Great. Now I’ve got more guilt pushing harder into my executive dysfunction trap and keeping me on the couch.Hopefully this helps someone else.",
        "label": "depression"
      },

      {
        "id": "73",
        "platform": "Facebook",
        "content": "Now I'm depressed & can't get off the couch",
        "label": "depression"
      },

      {
        "id": "74",
        "platform": "Facebook",
        "content": "All of this, but I can't crash when I get home. I have to be there for my kids. It's also why I have my animals the keep me here, present, and busy too. I'm not living in my own home so my animals can't be inside with me anymore and it's so hard to adjust to it. It's like I lost all of my security blankets all at once. Nothing beats snuggling in bed with my kids and animals.",
        "label": "depression"
      },

      {
        "id": "75",
        "platform": "Facebook",
        "content": "Yes…I’ll feel like I have motivation when I wake up and the littlest thing will pull me off of it and then feel down. Hote it",
        "label": "depression"
      },

      {
        "id": "76",
        "platform": "Facebook",
        "content": "I decided to stop this but I did it for 3 years after my Dad died and I moved back home to be closer to family. I was 3 years sober, the pandemic happened, rejected by family. I got tired of this. I have my Days but they are more seldom. I think I had to do this. I’m glad it is over.",
        "label": "depression"
      },

      {
        "id": "77",
        "platform": "Facebook",
        "content": "Literally going through it now. Begging for help and no one seems to care. It's rough. But I have 2 kids that need me. They are the only reason I'm still here. Makes me even more sad to say that b",
        "label": "depression"
      },

      {
        "id": "79",
        "platform": "Facebook",
        "content": "Some of us are pretty much just alone without many people to care about us. If I died tomorrow people would care about me way more then they ever did in life and that’s sad dude and sometimes selfishly makes me idealize the idea of it when I’m in my most depressed state.",
        "label": "depression"
      },

      {
        "id": "80",
        "platform": "Facebook",
        "content": "Therapy is great when you're receptive and not depressed, all the tools they teach you are to hemp in the situations that don't stop, breathing, counting, colors, mindfulness..... it all it's great when you're not in the state, a lot of us have been in therapy for years but doesn't change how I can be happy before I got to sleep and wake up emotionally depressed for weeks along with anxiety and all else that comes woth it..... sometimes finding a person or thing to live for is what helps.... in my case my father is what keeps me going when he leaves this earth hopefully I'll find something else",
        "label": "depression"
      },
      {

        "id": "81",
        "platform": "Facebook",
        "content": "I tried taking my life 3 times. My friends told me they always thought I was doing better because I seemed so happy. I was happy because it was ending. Obviously I’m still here and I’m glad I am, but as someone who has been so bad they had to be hospitalized, please keep an eye on your friends, and if they don’t make it please don’t take it personally. You are probably the reason they made it so long in the first place.",
        "label": "suicidal ideation"
      },
      {

        "id": "82",
        "platform": "Facebook",
        "content": "'But if only they had talked to me I could have helped...' that's the biggest line of BS from those that don't live with this. No you wouldn't. They have asked, but you were too busy, or just don't want to deal with their issues'. They know you see them as a burden, but reached out anyways. GTFOH with your 'it's selfish nonsense'",
        "label": "suicidal ideation"
      }, {

        "id": "83",
        "platform": "Facebook",
        "content": "I can't imagine feeling confident enough to tell someone it's okay to unalive yourself. Life's hard enough, I can't imagine having the strength or courage to leave my kids behind in this world. Every down shaped me into the person I am. Everything that ever showed me pain, also showed me the reason why I'll never get to those points in my life again. We could be homeless, in jail, and the whole world can be against us. That come back will provide the strength you need to continue. It can't get any worse than it already is unless you actually fucked yourself then you gotta eat your lesson, and come back mentally stronger. Life is special every single day. Being able to see anyone we love be happy is way more important than money. Being the change is way more better than becoming a percentage of a statistic. Keep fighting. Mental health is real.",
        "label": "suicidal ideation"
      }, {

        "id": "84",
        "platform": "Facebook",
        "content": "I struggled with depression, SH, suicidal thoughts, etc for years.I have been living in freedom now for for close to 5 years. There is hope. There is another side to what you are feeling. Finding people to open up to and be transparent with was a game changer. Jesus can and will move mountains. It’s doesn’t always look like how or when you expect it to but looking back I would not change my experience for anything. I am who I am today because of it.",
        "label": "suicidal ideation"
      }, {
        "id": "85",
        "platform": "Facebook",
        "content": "I never thought my life would lead me to a place where I could genuinely say I am living without an anxiety disorder. I am living without depression. I am living without Complex-PTSD and I get to HELP OTHER PEOPLE DO THAT! Like, holy shit! I get to make a life and living out of helping other people with their own healing journeys and that has been more meaningful than anything I could have ever hoped. ",
        "label": "suicidal ideation"
      }, {
        "id": "86",
        "platform": "Facebook",
        "content": "Two years ago today, i decided i had had enough. The best way i can put it is 'my brain was trying to kill me'. Suicidal ideation is a real struggle. The thoughts and feelings that lead to it are real. YEARS of fighting against my inner demons had worn me down, to the point that i was ready to give up and give in. I had it all planned out. The when. The how. But instead i walked into my counselor's office for… See more",
        "label": "suicidal ideation"
      },
      {
        "id": "87",
        "platform": "Facebook",
        "content": " And I never really had that. I just feel like sometimes I'm existing for the sake of existing out of procreation. I'm at a point in my life 7 years later, where I am steadily working towards improving myself and surviving. I just wonder to myself: when does this ever end?",
        "label": "suicidal ideation"
      },
      {
        "id": "88",
        "platform": "Facebook",
        "content": " WANNA DIE!!!💔💔😭😭😭😭😭 NO ONE CARES! I GOT NO FRIENDS! 💔💔💔😭😭😭 NO ONE HITS ME UP",
        "label": "suicidal ideation"
      },
      {
        "id": "89",
        "platform": "Facebook",
        "content": "my demons are winning",
        "label": "suicidal ideation"
      },
      {
        "id": "90",
        "platform": "Facebook",
        "content": "",
        "label": "suicidal ideation"
      }
    ]
  }
  