{
    "posts": [
      {
        "id": "1",
        "platform": "Twitter",
        "content": "I often wonder how many others are sitting near me, stuck in their own quiet battles with physical or mental or spiritual health, afraid or unwilling or even unable to discuss them, silently pleading for someone to extend any added amount of grace Carlee J Hansen #anxiety #quotes",
        "label": "anxiety"
        
      },
      {
        "id": "2",
        "platform": "Twitter",
        "content": "and a major fear of mine for a long time…….. #anxiety",
        "label": "anxiety"
      },
      {
        "id": "3",
        "platform": "Twitter",
        "content": "i'm tired. not like sleepy tired just tired of everything. I’m broken #mentalhealth#mentalillness #anxiety #sad",
        "label": "anxiety"
      },
      {
        "id": "4",
        "platform": "Twitter",
        "content": "Anxiety has a stronger presence in the room the more you try to push it out. Try letting it be there. You don’t have to be ok with it. Just tolerate it. Its intensity and importance will soon fade. You’ve got this.n",
        "label": "anxiety"
      },
      {
        "id": "5",
        "platform": "Twitter",
        "content": "Please if you can I could really use the help. I suffer from anxiety and I work 55hrs a week and in school. I have a son and I’m a single father.  I have falling behind and need help. #depression #anxiety #help",
        "label": "anxiety"
      },
      {
        "id": "6",
        "platform": "Twitter",
        "content": "I have stress about feeling hopeless in my situation… Sometimes on the outside I look happy and comfortable but at the inside I am going insane …all is grey and dark! even when the sun shines and the skies are blue …. #mentalillness #anxiety",
        "label": "anxiety"
      },
      {
        "id": "7",
        "platform": "Twitter",
        "content": "JFC I suck at posting across different apps. Always afraid I'll annoy people 🤦‍♀️ #crossposting #tiktok #Instagram #introvert #anxiety",
        "label": "anxiety"
      },
      {
        "id": "8",
        "platform": "Twitter",
        "content": "Sometimes we trick ourselves into thinking audiobooks, videos, blog posts is what we need. When in truth we’re just distracting ourselves from what we fear the most which is being one with and allowing thoughts and feelings to move through us. #anxiety",
        "label": "anxiety"
      },
      {
        "id": "9",
        "platform": "Twitter",
        "content": "Talking about the trauma that took place a year ago... I who thought that it had healed well it failed, during the discussion with my superiors and the fact that when we came to talk about it, (1/3) #stress #anxiety",
        "label": "anxiety"
      },
      {
        "id": "10",
        "platform": "Twitter",
        "content": "Behind this photo is someone who is struggling with #anxiety and #ptsd, along with long term neck and shoulder issues. Yet somehow I manage to put a smile on my face as best as I can #mentalhealth",
        "label": "anxiety"
      },
      {
        "id": "11",
        "platform": "Twitter",
        "content": "Weight gain due to depression is real ! Have put on 20+ kgs without any significant diet or activity changes !Not sure how to get back in shape !#Depression #weightgain #fitness",
        "label": "depression"
      },
      {
        "id": "12",
        "platform": "Twitter",
        "content": "Morning all. The sun is shining, but I still can’t shake this empty feeling. #depression There is so much worrying news in the world right now, and I’m fearful of the future. Scary stuff going on😢",
        "label": "depression"
      },
      {
        "id": "13",
        "platform": "Twitter",
        "content": "I'd rather my heart stop than continue to break.#alone #nobodylistens #depression #life #death  #EVERYTHING",
        "label": "depression"
      },
      {
        "id": "14",
        "platform": "Twitter",
        "content": "Good bloody thing I'm on my new meds this week from the #VAHospital. There are so many idiot people that think they are so entitled. Well surprise heros, you're not! Now going to cuddle with one our #GreatDanes and try and #Sleep. #Tinnitus #Depression #Anxiety #DogsAreTheBest",
        "label": "depression"
      },
      {
        "id": "15",
        "platform": "Twitter",
        "content": "#depression is real and I'm doing my best to beat this thing. #mentalhealth is serious and I'm on a mission to overcome this.",
        "label": "depression"
      },
      {
        "id": "16",
        "platform": "Twitter",
        "content": "I’ve hit a very important milestone in my life. I am now fat enough, and depressed enough, to get all of my clothes from Costco.",
        "label": "depression"
      },
      {
        "id": "17",
        "platform": "Twitter",
        "content": "Bc I’m listening to tame impala rn and I would do anything to be a millennial in their senior year of college going to Coachella in 2019 with their friends high on shrooms while I was forced to be a 4th grader that lived in Texas who was only 10 years old at the time #depression",
        "label": "depression"
      },
      {
        "id": "19",
        "platform": "Twitter",
        "content": "Depression is a bitch. So, more Final Fantasy XII! Come hang out!  #FinalFantasy #depression",
        "label": "depression"
      },
      {
        "id": "20",
        "platform": "Twitter",
        "content": "Couldn't stop crying till I was unable to breathe.Everyday is difficult to survive. Why am I posting all this here? The reason is I don't have anyone to listen. I've no idea how to deal with pain. #MentalHealthAwareness #MentalHealthSupport #depression",
        "label": "depression"
      },
      {
        "id": "21",
        "platform": "Twitter",
        "content": "Goes great with Benadryl & sleeping pills which has been my breakfast & dinner for the last several weeks. #suicidal",
        "label": "suicidal ideation"
      },
      {
        "id": "22",
        "platform": "Twitter",
        "content": "applying to jobs while at work, might become #suicidal if i don't quit soon",
        "label": "suicidal ideation"
      }, {
        "id": "23",
        "platform": "Twitter",
        "content": "Mine did. And shit broken down 💩🤡 that bitch saw everything in my body!! Couldn’t take it anymore. #Suicidal",
        "label": "suicidal ideation"
      }, {
        "id": "24",
        "platform": "Twitter",
        "content": "feeling #suicidal",
        "label": "suicidal ideation"
      }, {
        "id": "25",
        "platform": "Twitter",
        "content": "out in public with no makeup on feeling #suicidal",
        "label": "suicidal ideation"
      }, {
        "id": "26",
        "platform": "Twitter",
        "content": "Imagine being so brainwashed that you would make a video about lies and present them as facts. #TDS #SICKNESS #MENTAL_ILLNESS #BRAIN_DEAD  #SUICIDAL #INSTITUTIONALIZED #HUNGARY_TURD",
        "label": "suicidal ideation"
      },
      {
        "id": "27",
        "platform": "Twitter",
        "content": "entering  my  villain  era  after  these  ten  laps  y’all  hoes  better  let  me  in  .feeling:  #suicidal 💔😔‼️‼️",
        "label": "suicidal ideation"
      },
      {
        "id": "28",
        "platform": "Twitter",
        "content": "mood: #missmybitch #weup #Suicidal",
        "label": "suicidal ideation"
      },
      {
        "id": "29",
        "platform": "Twitter",
        "content": "thinking alot of thinks #suicidal",
        "label": "suicidal ideation"
      },
      {
        "id": "30",
        "platform": "Twitter",
        "content": "goodnight feeling #suicidal i hope i don’t wake up ever again🔥",
        "label": "suicidal ideation"
      }
    ]
  }
  