{
    "posts": [
      {
        "id": "31",
        "platform": "Reddit",
        "content": "Well it suppresses the physical effects of anxiety so I could see it making just about everything more tolerable.",
        "label": "anxiety"
        
      },
      {
        "id": "32",
        "platform": "Reddit",
        "content": "YTA.  Her greatest fear just got confirmed, she can easily be disposed of by both parents.  I can’t imagine the anxiety she suffers from and instead of reassuring her and confirming she always has a home with him , your brother looks for a way to abandon her and you condone his behavior!  ",
        "label": "anxiety"
      },
      {
        "id": "33",
        "platform": "Reddit",
        "content": "I attribute a lot of my social anxiety to this. It sucks that the model taught by schools (be quiet and listen) is the direct opposite of what's actually needed in adult life (basic social skills, networking, the ability to stand up for yourself)",
        "label": "anxiety"
      },
      {
        "id": "34",
        "platform": "Reddit",
        "content": "I know ‘did their best’ is lenient. I guess I meant they certainly tried to do the right thing, and in my dad’s case knew he was failing and showed remorse for it. I wonder if they had had mental help if it would have changed the outcome. I haven’t read any of the books you’re all recommending- my whole life I have for the most part tried to avoid non-fiction and heavy topics. It’s probably not the healthy thing to do, I know, but it’s helped me regulate my anxiety and sleep at night.",
        "label": "anxiety"
      },
      {
        "id": "35",
        "platform": "Reddit",
        "content": "An old job of mine would hold company wide mental health awareness days, all while my boss is telling me my crippling anxiety and depression is not a good enough reason to take time off sick.",
        "label": "anxiety"
      },
      {
        "id": "36",
        "platform": "Reddit",
        "content": "This is exactly why I started doing drugs. Painkillers and meth removed my anxiety and let me feel just normal and able to function around other people. Then one day I got anxiety while high on meth and it never went away while high. And because you're on meth the anxiety gets multiplied by 100. I had to be very careful about what I did around other people because I would be shaking so bad that it would give me away. Literally couldn't hold a pen and write my name.",
        "label": "anxiety"
      },
      {
        "id": "37",
        "platform": "Reddit",
        "content": "The pandemic definitely opened the door up for more school avoidance after students learned remotely. At one point I had struggled with school avoidance, which did come from anxiety, depression, and eventually a lack of will to continue living. My circumstances were pretty different from those of most however, so I would imagine that for the majority of people the pandemic and even just modern technology probably plays into school avoidance as a whole.",
        "label": "anxiety"
      },
      {
        "id": "38",
        "platform": "Reddit",
        "content": "Until the anxiety comes in so you can’t even sleep so it’s insomnia.",
        "label": "anxiety"
      },
      {
        "id": "39",
        "platform": "Reddit",
        "content": "As a kid I had anxiety and my heart would race. Fast. It felt like a hummingbird in my chest and would abruptly pause and resume a normal pace after a few minutes.At age 23 I had a bad reaction to a tricyclic antidepressant called imipramine and was rushed to the hospital. They ran an EKG and that rapid heart rate was a congenital defect known as Wolfe Parkinson White syndrom. Basically I had an accessory or 2nd electrical system in my heart that would cause a “short circuit” occasionally and my heart rate would skyrocket. It was cured via a procedure using radio waves to form scar tissue around the accessory node because the impulse could not conduct through the tissue.",
        "label": "anxiety"
      },
      {
        "id": "40",
        "platform": "Reddit",
        "content": "Shit like this is why people get anxiety",
        "label": "anxiety"
      },
      {
        "id": "41",
        "platform": "Reddit",
        "content": "Sleeping to avoid living. Even if you’re not necessarily tired.",
        "label": "depression"
      },
      {
        "id": "42",
        "platform": "Reddit",
        "content": "Constantly in a world in your head. I struggle with living like this. My mind and body are normally never in the same place.",
        "label": "depression"
      },
      {
        "id": "43",
        "platform": "Reddit",
        "content": "Feeling like it’s a chore to do things that you used to love doing.        ",
        "label": "depression"
      },
      {
        "id": "44",
        "platform": "Reddit",
        "content": "Snoozing for an eternity because you know what awaits you when you get up and face the day.",
        "label": "depression"
      },
      {
        "id": "45",
        "platform": "Reddit",
        "content": "Just kinda waiting for the day to end each day",
        "label": "depression"
      },
      {
        "id": "46",
        "platform": "Reddit",
        "content": "Depression doesn’t scream, it would require too much energy.",
        "label": "depression"
      },
      {
        "id": "47",
        "platform": "Reddit",
        "content": "I actually don't remember not being depressed. I believe I've had it since childhood.",
        "label": "depression"
      },
      {
        "id": "49",
        "platform": "Reddit",
        "content": "I met a girl, we instantly hit it off. Everything was perfect and she was my dream girl, even in my wildest imagination I couldn’t think of someone more perfect. Suddenly her ex bf came back into her life, threatened her with suicide if she ignores him, told her his whole family will blame her for his death. I knew the guy and i knew he is a loser and might actually do it. Anyways, i let her get back to him and wanted her to decide if she wants to comeback to me or stay with him. In the end, the guy who created the drama won and she married him 2 years later. I was in severe depression all that time and had 0 interest in anything, it was so hard to bounce back.",
        "label": "depression"
      },
      {
        "id": "50",
        "platform": "Reddit",
        "content": "I was molested as a child, I was bullied in school and grew up in a toxic household. A lot of my early memories are just my parents arguing and my mum getting physically violent with my dad. They both used to bully me for my weight as a kid/teen (I was a little bit chubby but still within the healthy range) and I ended up developing anorexia at 15. I’m getting therapy now and I feel like I can finally see some light at the end of the tunnel, but I don’t think I’ll ever be ‘better’ :/",
        "label": "depression"
      },
      {
        "id": "51",
        "platform": "Reddit",
        "content": "That's exactly how I've been feeling. Death would be so nice and peaceful. No having to deal with anxiety, sadness, anger, no more worries about jobs or money or family. Most times I wish I could die simply because it's peaceful and I wouldn't have to deal with this shit anymore. Like if I died, I would accept it and probably be happy about it. But at the same time, I have no desire to kill myself or harm myself. I'm not actively seeking death, but I would welcome it if it came to me. If that makes sense",
        "label": "suicidal ideation"
      },
      {
        "id": "52",
        "platform": "Reddit",
        "content": "This, so much this. I've been passively suicidal for decades, neglecting my health and hoping something major would fail and finally kill me.",
        "label": "suicidal ideation"
      }, {
        "id": "53",
        "platform": "Reddit",
        "content": "I am in my fourties and am stuck with these thoughts constantly since I was about 10 years old. This is a daily grind and only getting inebriated and sleep is escape.",
        "label": "suicidal ideation"
      }, {
        "id": "54",
        "platform": "Reddit",
        "content": "Yes. I feel that the only purpose of staying alive is the duty I owe to other people, either to care for them or just not hurt them. I would welcome no longer existing. My health has started going to hell and I’m not even 40. I don’t even care, I have no issue with the thought of my life being shorter.",
        "label": "suicidal ideation"
      }, {
        "id": "55",
        "platform": "Reddit",
        "content": "This is how I've felt for a long time. I'm not going to do anything, but I'm tired of being alive. I hate the thought of living another 50-70 years pretending to be happy or keep my head above the water.I was in a plane the other day and we had major turbulence. At one point I thought the plane might go down and it was honestly a massive sense of relief.",
        "label": "suicidal ideation"
      }, {
        "id": "56",
        "platform": "Reddit",
        "content": "I haven't attempted in awhile but I do weekdays wish that my heart would just stop.",
        "label": "suicidal ideation"
      },
      {
        "id": "57",
        "platform": "Reddit",
        "content": "This is a real thing. I struggle with smoking (pot). I'm the youngest of 7 siblings. I've already lost one (f*cking glioblastoma). I've realized I really don't want to outlive the others. :( At the same time I want to see my son grow into a man, so I have so far managed to kick smoking, taken up 3 season cycling, and am trying to figure out what to do with myself in the gym.",
        "label": "suicidal ideation"
      },
      {
        "id": "58",
        "platform": "Reddit",
        "content": "Very familiar with the feeling. Forcing death on the body seemed extreme, and would leave dark holes on other people lives, without knowing if taking own life would end the suffering, because it seemed way too easy, so just settled for praying to die as the only lifelong prayer. I have been fortunate where spiritual teachings resonated with me, and I have been able to turn my desire to die into a positive thing, since ego death is the road to happiness in spiritual context.",
        "label": "suicidal ideation"
      },
      {
        "id": "59",
        "platform": "Reddit",
        "content": "this is going to sound weird but low key wishing I was dead (and not minding if I do), makes people think of me as a fun, life-loving person which is hilarious (to me). I am always down to go anywhere and do anything as long as I can numb the dread for a few hours with alcohol, drugs and socializing. I come off as super confident and extroverted because I do not care AT ALL what happens to me or what people think of me. At the same time, everytime I cross the street I wonder what would happen if I didn’t look at the traffic sign, and sometimes I really don’t.",
        "label": "suicidal ideation"
      },
      {
        "id": "60",
        "platform": "Reddit",
        "content": "It’s like if someone was pointing a gun at me I wouldn’t actually feel threatened I would just wish they take a headshot. So getting mugged or something I would make it difficult and lowkey hope they pull the trigger. Technically it’s not suicide. It is what it is. Fuck life.",
        "label": "suicidal ideation"
      }
    ]
  }
  